import { ref, computed } from 'vue'
import { defineStore } from 'pinia'

export const useSSRStore = defineStore('ssr', () => {
    const SSR_character = {
        1013: "莱娜",
        1015: "维普蕾",
        1021: "佩里缇亚",
        1023: "杜莎妮",
        1025: "托洛洛",
        1027: "琼玖",
        1028: "桑朵莱希",
        1029: "塞布丽娜",
        1032: "黛烟",
        1033: "莫辛纳甘",
        1034: "玛绮朵",
        1035: "绛雨",
        1037: "乌尔丽德",
        1039: "索米",
        1040: "波波沙",
        1043: "绯",
        1048: "秋桦",
        1049: "哈卜茜",
        1050: "朝晖",
        1052: "可露凯",
        1053: "佩莉",
        1054: "幼熙",
        1055: "妮基塔",
        1056: "莱娅",
        1057: "洛贝拉",
        1058: "莱妮",
        1059: "琳德",
        1060: "翡图萨",
        1061: "巴希达",
        1064: "芙洛伦",
        1065: "埃芙",
        1066: "威玛西娜",
        1067: "海伦",
        1068: "樱花",
        1070: "夏安",
        1071: "贝丝蒂"
    }

    const SSR_weapon = {
        10713:"告死礼赞"
    }

    const SSR_permanent = {
        1015: "维普蕾",
        1021: "佩里缇亚",
        1025: "托洛洛",
        1027: "琼玖",
        1029: "塞布丽娜",
        1033: "莫辛纳甘",
        1043: "绯",
        1049: "哈卜茜",

    }

    return {SSR_character, SSR_weapon, SSR_permanent}
})